still can't deploy on dev net 

<img width="741" alt="Image" src="https://github.com/user-attachments/assets/933c0d9e-bb93-4893-889f-2b30583908da" />

logs 

```bash
single_vm_mycelium git:(development) ✗ terraform init && terraform apply -parallelism=1
Initializing the backend...
Initializing provider plugins...
- Finding latest version of threefoldtech/grid...
- Finding latest version of hashicorp/random...
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing threefoldtech/grid v1.11.3...
- Installed threefoldtech/grid v1.11.3 (self-signed, key ID 77AB02E5CA9698A3)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grid_deployment.d1 will be created
  + resource "grid_deployment" "d1" {
      + id                = (known after apply)
      + ip_range          = (known after apply)
      + name              = "testvm"
      + network_name      = "testvm"
      + node              = (known after apply)
      + solution_provider = 0

      + vms {
          + computedip       = (known after apply)
          + computedip6      = (known after apply)
          + console_url      = (known after apply)
          + corex            = false
          + cpu              = 2
          + entrypoint       = "/sbin/zinit init"
          + env_vars         = {
              + "SSH_KEY" = <<-EOT
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDKkaopr/tRilmLprntgqAO6JxnhzhrrB02KeUsNys9qj/G4RtXK4hKZo3yj42Kuoub53TxoW/BfZSRUbY0VNUgZSsifCyDE4g1UXi83ic+uepPb1VIfzlFdtZPUo/dEtjfS5FM7GVAPZCDik08w2+uXeZiAKavLTDQFh2cuIqE5QnQ44enODTMkSDPVJSKJ6NSoNcrY2I++AtcxgNFzy/7YWoT/bA19CliGqxBMSQ/GjOEAF3iQjUPc5LYcqCYAc0Y6WPt2l8uEVvhJAtsLelGApt8v/Nq/OBEKJpUQB2cfkyKlwLLphKFtQ8gcKjrbpE47lVsfbW68uqCw/5avA71HlS6AXxMeda8GZ99UqDTOLoUbd+EEo17hiHs6Nvle8DHNfWdGT2wx+DhzZeCO719UadmQxFLYDd75dDH5gLkMxr9JXPWDqdxvsyMZilxZPk3UQbK811obYSMrc9L+u8vwLs0weUBxnygutnU0eF9cRQxFgx3zOOfwI1ugI9SgSU= omarkassem099@gmail.com
                EOT
            }
          + flist            = "https://hub.grid.tf/tf-official-apps/base:latest.flist"
          + ip               = (known after apply)
          + memory           = 1024
          + mycelium_ip      = (known after apply)
          + mycelium_ip_seed = (sensitive value)
          + name             = "vm1"
          + planetary        = false
          + planetary_ip     = (known after apply)
        }
    }

  # grid_network.net1 will be created
  + resource "grid_network" "net1" {
      + access_wg_config   = (known after apply)
      + add_wg_access      = false
      + description        = "newer network"
      + external_ip        = (known after apply)
      + external_sk        = (known after apply)
      + id                 = (known after apply)
      + ip_range           = "10.1.0.0/16"
      + mycelium_keys      = (known after apply)
      + name               = "testvm"
      + node_deployment_id = (known after apply)
      + nodes              = (known after apply)
      + nodes_ip_range     = (known after apply)
      + public_node_id     = (known after apply)
      + solution_type      = "Network"
    }

  # grid_scheduler.sched will be created
  + resource "grid_scheduler" "sched" {
      + id    = (known after apply)
      + nodes = (known after apply)

      + requests {
          + cru              = 3
          + distinct         = false
          + mru              = 2048
          + name             = "node1"
          + node_exclude     = [
              + 33,
            ]
          + public_config    = false
          + public_ips_count = 0
          + sru              = 1024
          + wireguard        = false
          + yggdrasil        = false
        }
    }

  # random_bytes.mycelium_ip_seed will be created
  + resource "random_bytes" "mycelium_ip_seed" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 6
    }

  # random_bytes.mycelium_key will be created
  + resource "random_bytes" "mycelium_key" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 32
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm1_console_url = (known after apply)
  + vm1_ip          = (known after apply)
  + vm1_mycelium_ip = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_bytes.mycelium_ip_seed: Creating...
random_bytes.mycelium_ip_seed: Creation complete after 0s
random_bytes.mycelium_key: Creating...
random_bytes.mycelium_key: Creation complete after 0s
grid_scheduler.sched: Creating...
grid_scheduler.sched: Creation complete after 0s [id=1750318974]
grid_network.net1: Creating...
grid_network.net1: Still creating... [10s elapsed]
grid_network.net1: Still creating... [20s elapsed]
╷
│ Error: could not deploy network testvm: error waiting deployment: 4 errors occurred:
│ 	* connection timeout
│ 	* connection timeout
│ 	* connection timeout
│ 	* connection timeout
│
│
│
│   with grid_network.net1,
│   on main.tf line 38, in resource "grid_network" "net1":
│   38: resource "grid_network" "net1" {
│
╵
```